#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker]
azurerm_application_insights.ai01: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker-01]
azurerm_service_plan.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/serverfarms/plan-nbn-location-checker]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnlocationchecker]
azurerm_storage_container.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content]
azurerm_storage_blob.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content/1aa622978ce5243869134d46ab426e6c3658f554051b0a24b137c0c3dfc140a6.zip]
azurerm_linux_function_app.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.db will be created
  + resource "azurerm_cosmosdb_account" "db" {
      + access_key_metadata_writes_enabled    = true
      + analytical_storage_enabled            = false
      + connection_strings                    = (sensitive value)
      + create_mode                           = (known after apply)
      + default_identity_type                 = "FirstPartyIdentity"
      + enable_automatic_failover             = false
      + enable_free_tier                      = true
      + enable_multiple_write_locations       = false
      + endpoint                              = (known after apply)
      + id                                    = (known after apply)
      + is_virtual_network_filter_enabled     = false
      + kind                                  = "GlobalDocumentDB"
      + local_authentication_disabled         = false
      + location                              = "australiaeast"
      + mongo_server_version                  = (known after apply)
      + name                                  = "cosmosdb-acct-nbn-location-checker"
      + network_acl_bypass_for_azure_services = false
      + offer_type                            = "Standard"
      + primary_key                           = (sensitive value)
      + primary_readonly_key                  = (sensitive value)
      + public_network_access_enabled         = true
      + read_endpoints                        = (known after apply)
      + resource_group_name                   = "rg-nbn-location-checker"
      + secondary_key                         = (sensitive value)
      + secondary_readonly_key                = (sensitive value)
      + write_endpoints                       = (known after apply)

      + analytical_storage {
          + schema_type = (known after apply)
        }

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + type                = (known after apply)
        }

      + capabilities {
          + name = (known after apply)
        }

      + capacity {
          + total_throughput_limit = (known after apply)
        }

      + consistency_policy {
          + consistency_level       = "Session"
          + max_interval_in_seconds = (known after apply)
          + max_staleness_prefix    = (known after apply)
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "australiaeast"
          + zone_redundant    = false
        }
    }

  # azurerm_cosmosdb_sql_container.locations will be created
  + resource "azurerm_cosmosdb_sql_container" "locations" {
      + account_name        = "cosmosdb-acct-nbn-location-checker"
      + database_name       = "cosmosdb-acct-nbn-location-checker"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "locations"
      + partition_key_path  = "/servingArea/csaId"
      + resource_group_name = "rg-nbn-location-checker"
      + throughput          = (known after apply)

      + conflict_resolution_policy {
          + conflict_resolution_path      = (known after apply)
          + conflict_resolution_procedure = (known after apply)
          + mode                          = (known after apply)
        }

      + indexing_policy {
          + indexing_mode = (known after apply)

          + composite_index {
              + index {
                  + order = (known after apply)
                  + path  = (known after apply)
                }
            }

          + excluded_path {
              + path = (known after apply)
            }

          + included_path {
              + path = (known after apply)
            }

          + spatial_index {
              + path  = (known after apply)
              + types = (known after apply)
            }
        }

      + unique_key {
          + paths = [
              + "/addressDetail/id",
            ]
        }
    }

  # azurerm_cosmosdb_sql_container.subs will be created
  + resource "azurerm_cosmosdb_sql_container" "subs" {
      + account_name        = "cosmosdb-acct-nbn-location-checker"
      + database_name       = "cosmosdb-acct-nbn-location-checker"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "subs"
      + partition_key_path  = "/csaId"
      + resource_group_name = "rg-nbn-location-checker"
      + throughput          = (known after apply)

      + conflict_resolution_policy {
          + conflict_resolution_path      = (known after apply)
          + conflict_resolution_procedure = (known after apply)
          + mode                          = (known after apply)
        }

      + indexing_policy {
          + indexing_mode = (known after apply)

          + composite_index {
              + index {
                  + order = (known after apply)
                  + path  = (known after apply)
                }
            }

          + excluded_path {
              + path = (known after apply)
            }

          + included_path {
              + path = (known after apply)
            }

          + spatial_index {
              + path  = (known after apply)
              + types = (known after apply)
            }
        }

      + unique_key {
          + paths = [
              + "/email",
              + "/location_id",
            ]
        }
    }

  # azurerm_cosmosdb_sql_database.db will be created
  + resource "azurerm_cosmosdb_sql_database" "db" {
      + account_name        = "cosmosdb-acct-nbn-location-checker"
      + id                  = (known after apply)
      + name                = "cosmos-nbn"
      + resource_group_name = "rg-nbn-location-checker"
      + throughput          = 1000
    }

  # azurerm_linux_function_app.app will be updated in-place
  ~ resource "azurerm_linux_function_app" "app" {
      ~ app_settings                      = {
          ~ "WEBSITE_RUN_FROM_PACKAGE"   = (sensitive)
            # (2 unchanged elements hidden)
        }
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
        tags                              = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.app must be replaced
-/+ resource "azurerm_storage_blob" "app" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/1aa622978ce5243869134d46ab426e6c3658f554051b0a24b137c0c3dfc140a6.zip" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "1aa622978ce5243869134d46ab426e6c3658f554051b0a24b137c0c3dfc140a6.zip" -> "b81375b68359b0859fe0c291ef604bec7d0406e74531d94ef686c76f652d1a2c.zip" # forces replacement
      ~ url                    = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/1aa622978ce5243869134d46ab426e6c3658f554051b0a24b137c0c3dfc140a6.zip" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @scottmckenzie, Action: `pull_request`*